#include "stdio.h"
/*
企业发放的奖金根据利润提成。利润I低于或等于100000远的，奖金课题成10%；
利润高于100000元，低于200000元（100000<I<=200000）时，低于100000的部分按10%提成，
高于100000远的部分，课题成7.5%；200000<I<=400000时，低于200000远的部分仍按上述办法提成（下同）。
高于200000元的部分按5%提成；400000<I<=600000元时，高于400000元的部分按3%提成；
600000<I<=1000000时，高于600000元的部分按1.5%提成；I>1000000时，超过1000000元的部分按1%提成。
从键盘输入当月利润I，求应发奖金总数。
*/
int main(int argc, char const *argv[])
{
	/* if code */
	int i;
	double bonus,bon1,bon2,bon4,bon6,bon10;
	bon1 = 100000 * 0.1;
	bon2 = bon1 + 100000 * 0.075;
	bon4 = bon2 + 100000 * 0.05;
	bon6 = bon4 + 100000 * 0.03;
	bon10 = bon6 + 400000 * 0.015;
	printf("请输入利润:\n");
	scanf("%d",&i);
	if(i<=100000)
		bonus = i * 0.1;
	else if(i<=200000)
		bonus = bon1+(i-100000)*0.075;
	else if(i<=400000)
		bonus = bon2 + (i - 200000)*0.05;
	else if(i<=600000)
		bonus = bon4 + (i-400000) * 0.03;
	else if(i<=1000000)
		bonus = bon6 +(i-600000)*0.015;
	else
		bonus= bon10+(i-1000000)*0.01;
	printf("奖金是: %10.2f\n",bonus );


	return 0;
	//结果156890 -》14266.75

}